{"format": "graph-model", "generatedBy": "2.14.0", "convertedBy": "TensorFlow.js Converter v4.13.0", "signature": {"inputs": {"x": {"name": "x:0", "dtype": "DT_UINT8", "tensorShape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/ArgMax/dimension", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "x", "op": "Placeholder", "attr": {"dtype": {"type": "DT_UINT8"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}}}, {"name": "StatefulPartitionedCall/truediv/Cast", "op": "Cast", "input": ["x"], "attr": {"SrcT": {"type": "DT_UINT8"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Conv2D/ArithmeticOptimizer/FoldMultiplyIntoConv_scaled_StatefulPartitionedCall/StatefulPartitionedCall/Conv2D_ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/truediv/Cast"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/MatMul_1/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/truediv/Cast"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/truediv/Cast"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Conv2D_1/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/truediv/Cast"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Add_1/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/truediv/Cast"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd_1/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/truediv/Cast"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Reshape/shape", "op": "Const", "input": ["^StatefulPartitionedCall/truediv/Cast"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/MatMul/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/truediv/Cast"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1600"}, {"size": "100"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Add/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/truediv/Cast"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/truediv/Cast", "StatefulPartitionedCall/StatefulPartitionedCall/Conv2D/ArithmeticOptimizer/FoldMultiplyIntoConv_scaled_StatefulPartitionedCall/StatefulPartitionedCall/Conv2D_ReadVariableOp", "StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"filter_format": {"s": "SFdJTw=="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "num_host_args": {"i": "0"}, "leakyrelu_alpha": {"f": 0.2}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/Relu"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Relu_1", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/MaxPool2d", "StatefulPartitionedCall/StatefulPartitionedCall/Conv2D_1/ReadVariableOp", "StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "filter_format": {"s": "SFdJTw=="}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/MaxPool2d_1", "op": "MaxPool", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/Relu_1"], "attr": {"padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/MaxPool2d_1", "StatefulPartitionedCall/StatefulPartitionedCall/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Relu_2", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/Reshape", "StatefulPartitionedCall/StatefulPartitionedCall/MatMul/ReadVariableOp", "StatefulPartitionedCall/StatefulPartitionedCall/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Add_1", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/Relu_2", "StatefulPartitionedCall/StatefulPartitionedCall/MatMul_1/ReadVariableOp", "StatefulPartitionedCall/StatefulPartitionedCall/Add_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/Add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ArgMax", "op": "ArgMax", "input": ["StatefulPartitionedCall/Softmax", "StatefulPartitionedCall/ArgMax/dimension"], "attr": {"Tidx": {"type": "DT_INT32"}, "output_type": {"type": "DT_INT64"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/ArgMax"], "attr": {"T": {"type": "DT_INT64"}}}], "library": {}, "versions": {"producer": 1645}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/ArgMax/dimension", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Conv2D/ArithmeticOptimizer/FoldMultiplyIntoConv_scaled_StatefulPartitionedCall/StatefulPartitionedCall/Conv2D_ReadVariableOp", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/MatMul_1/ReadVariableOp", "shape": [100, 10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Conv2D_1/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Add_1/ReadVariableOp", "shape": [10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd_1/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/MatMul/ReadVariableOp", "shape": [1600, 100], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Add/ReadVariableOp", "shape": [100], "dtype": "float32"}]}]}