{"format": "graph-model", "generatedBy": "2.14.0", "convertedBy": "TensorFlow.js Converter v4.13.0", "signature": {"inputs": {"x": {"name": "x:0", "dtype": "DT_UINT8", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "-1"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/ArgMax/dimension", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "x", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "-1"}]}}, "dtype": {"type": "DT_UINT8"}}}, {"name": "StatefulPartitionedCall/Reshape", "op": "Reshape", "input": ["x", "StatefulPartitionedCall/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_UINT8"}}}, {"name": "StatefulPartitionedCall/truediv/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/Reshape"], "attr": {"DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_UINT8"}}}, {"name": "StatefulPartitionedCall/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/truediv/Cast", "ConstantFolding/StatefulPartitionedCall/truediv_recip"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/MatMul/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/truediv"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}, {"size": "700"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Add_2/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/truediv"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Add/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/truediv"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "700"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/MatMul_1/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/truediv"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "700"}, {"size": "500"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Add_1/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/truediv"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "500"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/MatMul_2/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/truediv"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "500"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/truediv", "StatefulPartitionedCall/StatefulPartitionedCall/MatMul/ReadVariableOp", "StatefulPartitionedCall/StatefulPartitionedCall/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Relu_1", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/Relu", "StatefulPartitionedCall/StatefulPartitionedCall/MatMul_1/ReadVariableOp", "StatefulPartitionedCall/StatefulPartitionedCall/Add_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Add_2", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/Relu_1", "StatefulPartitionedCall/StatefulPartitionedCall/MatMul_2/ReadVariableOp", "StatefulPartitionedCall/StatefulPartitionedCall/Add_2/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/Add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ArgMax", "op": "ArgMax", "input": ["StatefulPartitionedCall/Softmax", "StatefulPartitionedCall/ArgMax/dimension"], "attr": {"output_type": {"type": "DT_INT64"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/ArgMax"], "attr": {"T": {"type": "DT_INT64"}}}], "library": {}, "versions": {"producer": 1645}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "ConstantFolding/StatefulPartitionedCall/truediv_recip", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ArgMax/dimension", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/MatMul/ReadVariableOp", "shape": [784, 700], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Add_2/ReadVariableOp", "shape": [10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Add/ReadVariableOp", "shape": [700], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/MatMul_1/ReadVariableOp", "shape": [700, 500], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Add_1/ReadVariableOp", "shape": [500], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/MatMul_2/ReadVariableOp", "shape": [500, 10], "dtype": "float32"}]}]}